https://github.com/okovtun/VBD_311
https://www.youtube.com/watch?v=-0offnnEWa0&list=PLeqyOOqxeiIODTb1UOPGYMkMS8eP-Pf-x

HDD:
1. Почитать про RAID-массивы;
2. https://www.youtube.com/watch?v=7onkTUts_-w&t=218s;
3. https://www.youtube.com/watch?v=REeeBywe8_Y&t=140s;
4. https://www.youtube.com/watch?v=QIhJkzlCuws;

Cooling:
1. https://www.youtube.com/watch?v=A8KJwdVKTok&pp=ygUw0Y3RgtC-0YIg0LrQvtC80L_RjNGO0YLQtdGAINC-0YXQu9Cw0LbQtNC10L3QuNC1;
2. https://www.youtube.com/watch?v=AK3AyXErB1Y;
3. https://www.youtube.com/watch?v=Tidws9NKS6c&t=542s&pp=ygUw0Y3RgtC-0YIg0LrQvtC80L_RjNGO0YLQtdGAINC-0YXQu9Cw0LbQtNC10L3QuNC1;
4. https://www.youtube.com/watch?v=mALfZmxyOQ4&t=435s;
5. https://www.youtube.com/watch?v=FirsCzTnbdQ&pp=ygULSUhTIEhhc3dlbGw%3D;
6. https://www.youtube.com/watch?v=XXs0I5kuoX4&t=177s;

PSU:
https://ru.gecid.com/power/sovremennyee_bloki_pitaniya_atx_i_ih_harakteristiki/;

TODO:
1. В Solution 'ControlStructures' добавить проект 'Shooter', и в этом проекте реализовать программу,	DONE
   реагирующую на нажатие клавиш:
	w - впреред
	s - назад
	a - влево
	d - вправо
	space - прыжок
	enter - огонь
2. В Solution 'ConstrolStructures' добавить проект 'HomeWorkLoops',
   и в этом проекте решить следующие задачи:
    -возвести указанное число в указанную степень. Основание и показатель степени вводятся с клавиатуры;	DONE
	-вывести на экран таблицу ASCII-символов по 16 символов в строке;	DONE
	-вывести на экран ряд Фибоначчи до указанного предела;				DONE
	-вывести на экран заданное количество членов из ряда Фибоначчи;		DONE
		Ряд Фибоначчи строится из двух чисел - 0 и 1,
		и каждый следующий член ряда = сумме двух предыдущих:
			0	1	1	2	3	5	8	13	21
	-вывести на экран ряд простых чисел до заданного предела.			DONE
	 Простым называется число, которое делится только на себя и на 1.
3. В Solution 'ControlStructures' добавить проект 'Geometry', 
   и в этом проекте вывести в консоль следующие фигуры:
	https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/Geometria1.txt
4. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/ChessBoard.jpg
5. https://github.com/okovtun/BV_011/blob/master/ControlStructures/Geometria/Task/HardChess.jpg
6. Вывести на экран треугольник Паскаля;


TODO:
Подобрать комплектующие для Extreme Edition системы с 4-хканальным контроллером памяти.

DONE:
1. Написать программу "Калькулятор", которая принимает выражение вида:
	2+3
   и вычисляет результат этого выражения;
2. Написать программу, в которую вводится целое число, и программа определяет,
   является ли это число палиндромом.
   Палиндром - это число, которое читается одинаково в обоих направлениях,
   например:
	12321
	1221
	121

TODO:
https://overclockers.ru/lab/show/96704/obzor-i-testirovanie-materinskoj-platy-evga-x299-dark
https://www.amazon.co.uk/EVGA-X299-Intel-Motherboard-151-SX-E299-KR/dp/B079WCBP18?th=1
https://ru.gecid.com/mboard/asus_tuf_gaming_z790-pro_wifi/
Поверхностный эффект (Skin Effect);
Изучить шины PCI-Express и USB

TOREAD:
http://www.softelectro.ru/ieee754.html

TODO:
1. Выучить теорию.
2. Решить все задачи из файла:
	https://github.com/okovtun/VBD_311/blob/master/DataTypes/VariablesTask.pdf
3. Решить следующие задачи без испльзования компилятора:
	int i = 3;
	i = ++i + ++i;
	cout << i << endl;	//Что будет выведено на экран?
	//------------------------------------------------
	int i = 3;
	i = i++ + ++i;
	cout << i << endl;
	//------------------------------------------------
	int i = 3;
	i = i++ + 1 + ++i*2;
	cout << i << endl;
	//------------------------------------------------
	int i = 3;
	i = i++ + 1 + ++i*=2;
	cout << i << endl;
	//------------------------------------------------
	int i = 3;
	i += i++ + 1 + ++i*=2;
	cout << i << endl;


TODO:
1. Используя программы CPU-Z и AIDA-64 определить модель своего CPU, и его дополнительные наборы команд;
2. Используя программу AIDA-64 измерить производительность Кэша и памяти своего компьютера;
3. https://www.ixbt.com/cpu/x86-cpu-faq-2006.shtml
   https://www.ixbt.com/cpu/cpu-digest-2009.shtml
4. ark.intel.com
	https://www.intel.com/content/www/us/en/processors/processor-numbers.html

TODO:
1. Выучить теорию!
2. Используя Escape-последовательности, вывести в окно консоли стишок "В лесу родилась Ёлочка"
   Стишок доолжен быть выровнен по середине окна консоли, и куплеты должны быть разделены пустой строкой;

DONE:
1. Вычислить пропускные способности для памяти DDR4/DDR5;
2. Используя программу CPU-Z, определить конфигурацию и характеристики ОЗУ своего компьютера:
	Количество моддулей памяти, маркировку модулей, тип микросхем памяти (DDR3/DDR4/DDR5), 
	производитель модулей памяти;
		https://www.cpuid.com/softwares/cpu-z.html
3. Используя программу AIDA-64, определить конфигурацию и характеристики ОЗУ своего компьютера:
	Количество моддулей памяти, маркировку модулей, тип микросхем памяти (DDR3/DDR4/DDR5), 
	производитель модулей памяти;
		https://www.aida64.com/downloads/YmQ1ZDlhMjQ=